Revit 2027 API
TableView.GetCellText Method
 Gets the cell's text based on its type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCellText(
	SectionType sectionType,
	int row,
	int column
)
Public Function GetCellText (
	sectionType As SectionType,
	row As Integer,
	column As Integer
) As String
public:
String^ GetCellText(
	SectionType sectionType,
	int row,
	int column
)
member GetCellText :
        sectionType : SectionType *
        row : int *
        column : int -> string
Parameters
sectionType SectionType
 The requested section type
row Int32
 Row Number in the Section
column Int32
 Column Number in the Section
Return Value
String
 The text for the given cell
Exceptions
Exception | Condition
ArgumentException |  The sectionType is not a valid type for this view.
ArgumentOutOfRangeException |  The given row number row is invalid. -or- The given column number column is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace